---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.VectorAtPoint
source: html/c901b9a5-a592-e008-fc82-76c8b89fe78f.htm
---
# VectorAtPoint Properties

Specifies whether the .NET object represents a valid Revit entity.